#+BEGIN_SRC http
PUT https://tungdao.com/metrics/webhooks/github
Content-Type: application/json
X-Github-Event: push

{
  "ref": "refs/tags/simple-tag",
  "before": "6113728f27ae82c7b1a177c8d03f9e96e0adf246",
  "after": "0000000000000000000000000000000000000000",
  "created": false,
  "deleted": true,
  "forced": false,
  "base_ref": null,
  "compare": "https://github.com/Codertocat/Hello-World/compare/6113728f27ae...000000000000",
  "commits": [true],
  "head_commit": null,
  "repository": {
    "id": 186853002,
    "node_id": "MDEwOlJlcG9zaXRvcnkxODY4NTMwMDI=",
    "name": "Hello-World",
    "full_name": "Codertocat/Hello-World"
  }
}
#+END_SRC

#+RESULTS:
: HTTP/2 405 
: date: Thu, 26 Sep 2019 09:16:48 GMT
: content-type: text/html; charset=UTF-8
: set-cookie: __cfduid=d5313e709c565116d813992301bd38ff11569489408; expires=Fri, 25-Sep-20 09:16:48 GMT; path=/; domain=.tungdao.com; HttpOnly; Secure
: expect-ct: max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
: server: cloudflare
: cf-ray: 51c424225dabd193-HKG
:
: <html><title>405: Method Not Allowed</title><body>405: Method Not Allowed</body></html>
